{

    "name" : "Paladin",
    "caster_type" : "Half",
    "hitDie" : 10,
    "armor_prof" : ["Light", "Medium", "Heavy", "Shields"],
    "weapon_prof" : ["Simple", "Martial"],
    "tools_prof": [],
    "saving_throws" : ["Wisdom", "Charisma"],
    "skill_prof" : {"choice" : 2, "skills" : ["Athletics", "Insight", "Intimidation", "Medicine", "Persuasion", "Religion"]},
    "equipment" : ["(a) a martial weapon and a shield or (b) two martial weapons", "(a) five javelins or (b) any simple melee weapon", "(a) a priest's pack or (b) an explorer's pack", "Chain mail and a holy symbol"],
    "starting_gold" : {"multiplier" : 10, "num_die" : 5, "die" : 4},
    "misc_table_features" : [],
    "features" : [
        {"name" : "Divine Sense", "lvl" : [1], "desc" : "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the Hallow spell.You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."}
       , {"name" : "Lay on Hands", "lvl" : [1], "desc" : "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. For every 5 hit points you restore, the creature regains one spent hit die.Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.This feature has no effect on undead and constructs."}
       , {"name" : "Fighting Style", "lvl" : [2], "desc" : "Starting at 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.\n\tBlessed Warrior. You learn two cantrips of your choice from the cleric spell list. They count as paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the cleric spell list.\n\tBlind Fighting. You have blindsight with a range equal to five times your proficiency bonus . Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.\n\tDefense. While you are wearing armor, you gain a +1 bonus to AC.If your armor has a DR value, you gain a +1 to DR as well\n\tDueling . When you are attacking a melee weapon with the finesse property using Dexterity and nothing else in your hands, you may add a +2 to your attack rolls.\n\tFeatherweight Fighting .While you are unarmed or wielding only light weapons, and are not wearing medium or heavy armor, your walking speed increases by 10 feet, and you gain a +1 bonus to your damage rolls with light melee weapons and unarmed strikes.\n\tGreat Weapon Fighting. When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die\n\tInterception. When a creature you can see hits a target, other than you, within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction.\n\tProtection. When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.\n\tStandard Bearer. When a friendly creature within 5 feet of you attacks another target that you can see, you can use your reaction to grant it advantage on its attack roll. You must be holding a standard or banner in one of your hands (and nothing else in that hand) to use this reaction.\n\tThrown Weapon Fighting. You can draw a weapon that has the thrown property as part of the attack you make with the weapon.\nIn addition, when you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll.\n\tTwo-Weapon Fighting. When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."}
       , {"name" : "Spellcasting", "lvl" : [2], "desc" : "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does."}
        , {"name" : "Preparing and Casting Spells", "sub" : true, "lvl" : [2], "desc" : "The Paladin table shows how many spell slots you have to cast your paladin spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."}
        , {"name" : "Spellcasting Ability", "sub" : true, "lvl" : [2], "desc" : "Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one. Spell save DC = 8 + your proficiency bonus + your Charisma modifierSpell attack modifier = your proficiency bonus + your Charisma modifier"}
        , {"name" : "Spellcasting Focus", "sub" : true, "lvl" : [2], "desc" : "You can use a holy symbol as a spellcasting focus for your paladin spells."}
        , {"name" : "Divine Smite", "lvl" : [2], "desc" : "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."}
        , {"name" : "Divine Health", "lvl" : [2], "desc" : "By 3rd level, the divine magic flowing through you makes you immune to disease."}
        , {"name" : "Sacred Oath", "subclassOptions" : true,  "lvl" : [3], "desc" : "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature."}
        , {"name" : "Oath Spells", "lvl" : [3], "sub" : true, "desc" : "Each oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don't count against the number of spells you can prepare each day.If you gain an oath spell that doesn't appear on the paladin spell list, the spell is nonetheless a paladin spell for you."}
        , {"name" : "Channel Divinity", "lvl" : [3], "sub" : true, "desc" : "Your oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."}
        , {"name" : "Harness Divine Power", "lvl" : [3], "desc" : "Also at 3rd level, you can expend a use of your Channel Divinity to fuel your spells. As a bonus action, you touch your holy symbol, utter a prayer, and regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). The number of times you can use this feature is based on the level you've reached in this class: 3rd level, once; 7th level, twice; and 15th level, thrice. You regain all expended uses when you finish a long rest."}
        , {"name" : "Ability Score Improvement", "lvl" : [4, 8, 12, 16, 19], "desc" : "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."}
        , {"name" : "Martial Versatility", "lvl" : [4, 8, 12, 16, 19], "desc" : "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace a fighting style you know with another fighting style available to paladins. This replacement represents a shift of focus in your martial practice."}
        , {"name" : "Extra Attack", "lvl" : [5], "desc" : "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."}
        , {"name" : "Aura of Protection", "lvl" : [6, 18], "prog" : ["(10 feet)", "(30 feet)"],  "desc" : "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.At 18th level, the range of this aura increases to 30 feet."}
        , {"name" : "Aura of Courage", "lvl" : [10, 18], "prog" : ["(10 feet)", "(30 feet)"], "desc" : "Starting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious.At 18th level, the range of this aura increases to 30 feet."}
        , {"name" : "Improved Divine Smite", "lvl" : [11], "desc" : "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage."}
        , {"name" : "Cleansing Touch", "lvl" : [14], "desc" : "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."}


           , {"name" : "Tenets of the Ancients", "subclass" : "Ancients", "lvl" : [3], "desc" : "The tenets of the  Ancients have been preserved for uncounted centuries. This oath emphasizes the principles of good above any concerns of law or chaos. Its four central principles are simple.\nKindle the Light. Through your acts of mercy, kindness, and forgiveness, kindle the light of hope in the world, beating back despair.\nShelter the Light. Where there is good, beauty, love, and laughter in the world, stand against the wickedness that would swallow it. Where life flourishes, stand against the forces that would render it barren.\nPreserve Your Own Light. Delight in song and laughter, in beauty and art. If you allow the light to die in your own heart, you can't preserve it in the world.\nBe the Light. Be a glorious beacon for all who live in despair. Let the light of your joy and courage shine forth in all your deeds."}
        , {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
            ["3rd", ["~sn^Ensnaring Strike~#", "~sn^Speak with Animals~#"] ],
            ["5th", ["~sn^Moonbeam~#", "~sn^Misty Step~#"] ],
            ["9th", ["~sn^Plant Growth~#", "~sn^Protection from Energy~#"] ],
            ["13th", ["~sn^Ice Storm~#", "~sn^Stoneskin~#"]],
            ["17th", ["~sn^Commune with Nature~#", "~sn^Tree Stride~#"]]
            
        ]}, "lvl" : [3], "subclass" : "Ancients", "desc" : "You gain oath spells at the paladin levels listed."}

        ,{"name" : "Ancients Divinity", "lvl" : [3], "subclass" : "Ancients", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tNature's Wrath. You can use your Channel Divinity to invoke primeval forces to ensnare a foe. As an action, you can cause spectral vines to spring up and reach for a creature within 10 feet of you that you can see. The creature must succeed on a Strength or Dexterity saving throw (its choice) or be restrained. While restrained by the vines, the creature repeats the saving throw at the end of each of its turns. On a success, it frees itself and the vines vanish.\n\tTurn the Faithless. You can use your Channel Divinity to utter ancient words that are painful for fey and fiends to hear. As an action, you present your holy symbol, and each fey or fiend within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage.\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.\nIf the creature's true form is concealed by an illusion, shapeshifting, or other effect, that form is revealed while it is turned."}
        ,{"name" : "Aura of Warding", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : "Ancients", "desc" : "Beginning at 7th level, ancient magic lies so heavily upon you that it forms an eldritch ward. You and friendly creatures within 10 feet of you have resistance to damage from spells.At 18th level, the range of this aura increases to 30 feet."}
        ,{"name" : "Undying Sentinel", "lvl" : [15], "subclass" : "Ancients", "desc" : "Starting at 15th level, when you are reduced to 0 hit points and are not killed outright, you can choose to drop to 1 hit point instead. Once you use this ability, you can't use it again until you finish a long rest.Additionally, you suffer none of the drawbacks of old age, and you can't be aged magically."}

        ,{"name" : "Elder Champion", "lvl" : [20], "subclass" : "Ancients", "desc" : "At 20th level, you can assume the form of an ancient force of nature, taking on an appearance you choose. For example, your skin might turn green or take on a bark-like texture, your hair might become leafy or moss-like, or you might sprout antlers or a lion-like mane.\nUsing your action, you undergo a transformation. For 1 minute, you gain the following benefits:\n\tAt the start of each of your turns, you regain 10 hit points.\n\tWhenever you cast a paladin spell that has a casting time of 1 action, you can cast it using a bonus action instead.\n\tEnemy creatures within 10 feet of you have disadvantage on saving throws against your paladin spells and Channel Divinity options.\nOnce you use this feature, you can't use it again until you finish a long rest."}

         ,{"name" : "Tenets of the Black Serpent", "lvl" : [3], "subclass" : " Black Serpent", "desc" : "\tHonesty: Be open with your intentions, utter no lie and leave no silence or omission to disguise your words.\n\tSubtlety: Walk quiet steps, and leave no trace of your deeds, unless there is a need for it.\n\tVigilance: Keep a close eye on your surroundings, leave no trace of a threat uninvestigated\n\tDiscipline: Be methodical and calculating, even as rage makes your heart boil."}
         , {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
            ["3rd", ["~sn^Find Familiar~#", "~sn^Hunter's Mark~#"] ],
            ["5th", ["~sn^Wrack~#", "~sn^Pass without Trace~#"] ],
            ["9th", ["~sn^Mirror Spell~#", "~sn^Nondetection~#"] ],
            ["13th", ["~sn^Dimension Door~#", "~sn^Arcane Eye~#"]],
            ["17th", ["~sn^Far Step~#", "~sn^Geas~#"]]
            
        ]}, "lvl" : [3], "subclass" : " Black Serpent", "desc" : "You gain oath spells at the paladin levels listed."}
        ,{"name" : "Black Serpent Divinity", "lvl" : [3], "subclass" : " Black Serpent", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tSerpent's Kiss: When you are about to make a weapon attack with a weapon that has poison tipped or coated, you can choose to channel your power through it. On a hit, the target automatically fails the first saving throw against this poison.\n\tOrder’s Mark: Immediately after you cast Hunter's Mark on a creature, you can use your channel divinity to give it the order’s mark. Allied creatures have a bonus to attack rolls towards that creature equal to your Charisma Modifier (minimum of +1)"}
        ,{"name" : "Serpent’s Cloak", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : " Black Serpent", "desc" : "Starting at 7th level, you constantly emanate a purple aura while you're not incapacitated. The aura extends 10 feet from you in every direction, but not through total cover.Any hostile creature within this aura has disadvantage on Saving Throws against poisons, and you can add your Charisma Modifier (Minimum of +1) to the DC of Saving Throws of any poisons creatures inflict on hostile creatures within this range.At 18th level, the range of this aura increases to 30 feet."}
        ,{"name" : "Headhunter", "lvl" : [15], "subclass" : " Black Serpent", "desc" : "When you reach 15th level in this class you have become a dedicated headhunter. Once you cast the Order’s mark on a target, it stays on it for up to 24 hours without the need for concentration. You are aware of the location of the marked target as long as it stays within the same plane of existence."}
        ,{"name" : "Black Serpent", "lvl" : [20], "subclass" : " Black Serpent", "desc" : "At 20th level, you have reached the pinnacle in the order, and are anointed with the powers once bestowed to The Black Serpent. As an action, you gain the following benefits for 1 hour:\n\t-You become immune to all effects from poisons and perfumes, unless you decide to subject yourself to them.\n\t-You gain resistance to all sources of damage that do not come from Salted Weapons.\n\t-You gain truesight to a range of 60 feet.\nOnce you use this feature, you can't use it again until you finish a long rest."}
     ,{"name" : "Tenets of Conquest", "lvl" : [3], "subclass" : "Conquest", "desc" : "\tDouse the Flame of Hope: It is not enough to merely defeat an enemy in battle. Your victory must be so overwhelming that your enemies’ will to fight is shattered forever. A blade can end a life. Fear can end an empire.\n\tRule with an Iron Fist: Once you have conquered, tolerate no dissent. Your word is law. Those who obey it shall be favored. Those who defy it shall be punished as an example to all who might follow.\n\tStrength Above All: You shall rule until a stronger one arises. Then you must grow mightier and meet the challenge, or fall to your own ruin."},
        {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
            ["3rd", ["~sn^Armor of Agathys~#", "~sn^Command~#"] ],
            ["5th", ["~sn^Hold Person~#", "~sn^Spiritual Weapon~#"] ],
            ["9th", ["~sn^Bestow Curse~#", "~sn^Fear~#"] ],
            ["13th", ["~sn^Dominate Beast~#", "~sn^Stoneskin~#"]],
            ["17th", ["~sn^Cloudkill~#", "~sn^Dominate Person~#"]]
            ]}, "lvl" : [3], "subclass" : "Conquest", "desc" : "You gain oath spells at the paladin levels listed."},
        {"name" : "Channel Divinity", "lvl" : [3], "subclass" : "Conquest", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tConquering Presence: You can use your Channel Divinity to exude a terrifying presence. As an action, you force each creature of your choice that you can see within 30 feet of you to make a Wisdom saving throw. On a failed save, a creature becomes frightened of you for 1 minute. The frightened creature can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success.\n\tGuided Strike: You can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."},
        {"name" : "Aura of Conquest", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : "Conquest", "desc" : "Starting at 7th level, you constantly emanate a menacing aura while you're not incapacitated. The aura extends 10 feet from you in every direction, but not through total cover.\nIf a creature is frightened of you, its speed is reduced to 0 while in the aura, and that creature takes psychic damage equal to half your paladin level if it starts its turn there.\nAt 18th level, the range of this aura increases to 30 feet."},
        {"name" : "Scornful Rebuke", "lvl" : [15], "subclass" : "Conquest", "desc" : "Starting at 15th level, those who dare to strike you are psychically punished for their audacity. Whenever a creature hits you with an attack, that creature takes psychic damage equal to your Charisma modifier (minimum of 1) if you’re not incapacitated."},
        {"name" : "Invincible Conqueror", "lvl" : [20], "subclass" : "Conquest", "desc" : "At 20th level, you gain the ability to harness extraordinary martial prowess. As an action, you can magically become an avatar of conquest, gaining the following benefits for 1 minute:\n\t-You have resistance to all damage.\n\t-When you take the Attack action on your turn, you can make one additional attack as part of that action.\n\t-Your melee weapon attacks score a critical hit on a roll of 19 or 20 on the d20.\nOnce you use this feature, you can’t use it again until you finish a long rest."}
  ,{"name" : "Tenets of Crimson Chalice", "lvl" : [3], "subclass" : " Crimson Chalice", "desc" : "\tSealed Lips, Clear Mind: Utter no word nor allow any thought that is irrelevant to your mission.\n\tCold Heart, Boiling Blood: Leave no place for the living within your heart, and carry yourself in every action as if your existence depended on its success.\n\tMountains of Corpses, Rivers of Blood: Power can only be archived on top the bodies of thousands, and the hunger can only be staved with their blood.\n\tRelentless Persistence, Endless Patience: Pursue your mission until it is fulfilled, yet keep caution in hand and your wits honed on your surroundings.\n\tFathomless Hunger, Tempered Soul: Let your hunger for blood be endless, become a Dhampir by accepting the blood of Crimson Chalice. But never let it dictate your actions."},
        {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
            ["3rd", ["~sn^Hunter's Mark~#", "~sn^Blood Rush~#"] ],
            ["5th", ["~sn^Sense Lifeblood~#", "~sn^Theft of Vitae~#"] ],
            ["9th", ["~sn^Revitalize~#", "~sn^Gut Feeling~#"] ],
            ["13th", ["~sn^Dark Sacrament~#", "~sn^Circle of Scarlet~#"]],
            ["17th", ["~sn^Commune~#", "~sn^Heartseeker~#"]]
            ]}, "lvl" : [3], "subclass" : " Crimson Chalice", "desc" : "You gain oath spells at the paladin levels listed."},
        {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " Crimson Chalice", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tRelentless Pursuit: As an action, you embolden your heart and make your blood boil. For the next minute, your movement speed increases by five times your Charisma modifier (minimum of +5) whenever you are moving directly towards an enemy, and difficult terrain does not cost you extra movement when doing so.\n\tCrimson Vow: Immediately after you or an ally you can see within 30 feet casts a **Sangromancy** spell, you can spend your Channel Divinity to embolden it. You can add up to your Charisma modifier (minimum of +1) of hit die to the spell’s first damage."},
        {"name" : "Aura of Blood", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : " Crimson Chalice", "desc" : "Starting at 7th level, you constantly emanate a crimson aura while you're not incapacitated. The aura extends 10 feet from you in every direction, but not through total cover.\nAny hostile creature within this aura has disadvantage on Saving Throws against **Sangromancy** spells, and you can add your Charisma modifier (minimum of +1) to any damage rolls of **Sangromancy** spells that hit creatures within this aura.\nAt 18th level, the range of this aura increases to 30 feet."},
        {"name" : "Crimson Tithe", "lvl" : [15], "subclass" : " Crimson Chalice", "desc" : "When you reach 15th level in this class you hold total control over your hunger, and can feed off the blood you draw from your enemies. Once per turn, whenever you deal damage with a melee attack or **Sangromancy** spell, you regain lost hit points equal to the damage dealt, up to your Paladin Level."},
        {"name" : "Tempered Frenzy", "lvl" : [20], "subclass" : " Crimson Chalice", "desc" : "At 20th level, you have reached such a control of the Fathomless Hunger that you can tap into it to enter a tempered frenzy. As an action, you gain the following benefits for 1 hour:\n\t-Your speed doubles when moving towards a hostile creature or following its path, and cannot be reduced by difficult terrain.\n\t-You can sense the presence of every creature that has blood within a 100 foot radius. You know how many hit points it has remaining, if it is below half its maximum, and what type of creature it is.\n\t-You have a bonus to attack and damage rolls to creatures that have blood equal to your Charisma modifier (minimum of +1).\nOnce you use this feature, you can't use it again until you finish a long rest."}
    


        ,{"name" : "Tenets of the Crown", "lvl" : [3], "subclass" : " Crown", "desc" : "\tLaw: The law is paramount. It is the mortar that holds the stones of civilization together, and it must be respected.\n\tLoyalty: Your word is your bond. Without loyalty, oaths and laws are meaningless.\n\tCourage: You must be willing to do what needs to be done for the sake of order, even in the face of overwhelming odds. If you don't act, then who will?\n\tResponsibility: You must deal with the consequences of your actions, and you are responsible for fulfilling your duties and obligations."},
        {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
            ["3rd", ["~sn^Command~#", "~sn^Compelled Duel~#"] ],
            ["5th", ["~sn^Warding Bond~#", "~sn^Zone of Truth~#"] ],
            ["9th", ["~sn^Aura of Vitality~#", "~sn^Spirit Guardians~#"] ],
            ["13th", ["~sn^Banishment~#", "~sn^Guardian of Faith~#"]],
            ["17th", ["~sn^Circle of Power~#", "~sn^Geas~#"]]
            ]}, "lvl" : [3], "subclass" : " Crown", "desc" : "You gain oath spells at the paladin levels listed."},
        {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " Crown", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tChampion Challenge: As a bonus action, you issue a challenge that compels other creatures to do battle with you. Each creature of your choice that you can see within 30 feet of you must make a Wisdom saving throw. On a failed save, a creature can't willingly move more than 30 feet away from you. This effect ends on the creature if you are incapacitated or die or if the creature is more than 30 feet away from you.\n\tTurn the Tide: As a bonus action, you can bolster injured creatures with your Channel Divinity. Each creature of your choice that can hear you within 30 feet of you regains hit points equal to 1d6 + your Charisma modifier (minimum of 1) if it has no more than half of its hit points."},
        {"name" : "Divine Allegiance", "lvl" : [7], "subclass" : " Crown", "desc" : "Starting at 7th level, when a creature within 5 feet of you takes damage, you can use your reaction to magically substitute your own health for that of the target creature, causing that creature not to take the damage. Instead, you take the damage. This damage to you can't be reduced or prevented in any way."},
        {"name" : "Unyielding Saint", "lvl" : [15], "subclass" : " Crown", "desc" : "Starting at 15th level, you have advantage on saving throws to avoid becoming paralyzed or stunned."},
        {"name" : "Exalted Champion", "lvl" : [20], "subclass" : " Crown", "desc" : "At 20th level, your presence on the field of battle is an inspiration to those dedicated to your cause. You can use your action to gain the following benefits for 1 hour:\n\t-You have resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.\n\t-Your allies have advantage on death saving throws while within 30 feet of you.\n\t-You have advantage on Wisdom saving throws, as do your allies within 30 feet of you.\nThis effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest."}
       ,
  {"name" : "Tenets of Devotion", "lvl" : [3], "subclass" : " Devotion", "desc" : "\tHonesty: Don't lie or cheat. Let your word be your promise.\n\tCourage: Never fear to act, though caution is wise.\n\tCompassion: Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom.\n\tHonor: Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm.\n\tDuty: Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Protection from Evil and Good~#", "~sn^Sanctuary~#"] ],
      ["5th", ["~sn^Lesser Restoration~#", "~sn^Zone of Truth~#"] ],
      ["9th", ["~sn^Beacon of Hope~#", "~sn^Dispel Magic~#"] ],
      ["13th", ["~sn^Freedom of Movement~#", "~sn^Guardian of Faith~#"]],
      ["17th", ["~sn^Commune~#", "~sn^Flame Strike~#"]]
    ]}, "lvl" : [3], "subclass" : " Devotion", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " Devotion", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tSacred Weapon: As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.\nYou can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends.\n\tTurn the Unholy: As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."},
  {"name" : "Aura of Devotion", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : " Devotion", "desc" : "Starting at 7th level, you and friendly creatures within 10 feet of you can't be charmed while you are conscious.\nAt 18th level, the range of this aura increases to 30 feet."},
  {"name" : "Purity of Spirit", "lvl" : [15], "subclass" : " Devotion", "desc" : "Beginning at 15th level, you are always under the effects of a ~sn^Protection from Evil and Good~# spell."},
  {"name" : "Holy Nimbus", "lvl" : [20], "subclass" : " Devotion", "desc" : "At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.\nWhenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.\nIn addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.\nOnce you use this feature, you can't use it again until you finish a long rest."}

  
  ,
  {"name" : "Tenets of The Famigliare", "lvl" : [3], "subclass" : " The Famigliare", "desc" : "\tFamily: Love each brother and sister like you shared a bond of blood.\n\tSagacity: Act swiftly and with wits, leave your sword as the last resort.\n\tAct With Passion: Let your heart’s content be shown to all who witness your every step.\n\tDiplomacy: Words cut deeper than blades, and so they are mightier."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Find Familiar~#", "~sn^Signature~#"] ],
      ["5th", ["~sn^Sphere of Silence~#", "~sn^Find Steed~#"] ],
      ["9th", ["~sn^Sending~#", "~sn^Nondetection~#"] ],
      ["13th", ["~sn^Dress of Rainbows~#", "~sn^Conjure Crystal Spider~#"]],
      ["17th", ["~sn^Modify Memory~#", "~sn^Far Step~#"]]
    ]}, "lvl" : [3], "subclass" : " The Famigliare", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " The Famigliare", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tBeguiling Speech: As an action, you can channel your divine power into your attempts to convince, persuade, and manipulate. For the next minute, you can treat any Charisma Skill Check roll lower than a 9 as a 10.\n\tMight of The Family: Immediately after you roll any Skill Check, you can harness your Channel Divinity to choose to succeed. You can do this after you roll the skill check, but before the DM declares whether or not it succeeds."},
  {"name" : "Aura of Heart&Wit", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : " The Famigliare", "desc" : "Starting at 7th level, you constantly emanate a warm aura while you're not incapacitated. The aura extends 10 feet from you in every direction, but not through total cover.\nAny friendly creature within this aura has a bonus to Deception, Insight, and Persuasion skill checks equal to your Charisma Modifier (minimum of +1).\nAt 18th level, the range of this aura increases to 30 feet."},
  {"name" : "Family Might", "lvl" : [15], "subclass" : " The Famigliare", "desc" : "When you reach 15th level in this class, you have become tempered by the constant might of your Family. You gain a bonus to attack and damage rolls equal to the number of friendly creatures within 10 feet, up to your Charisma Modifier (minimum of +1)."},
  {"name" : "Legendary Familliar", "lvl" : [20], "subclass" : " The Famigliare", "desc" : "At 20th level, you can assume the form of the Legendary Familliar. As an action, you gain the following benefits for 1 hour:\n\t-You can treat any roll on a skill check of 14 or below as a 15.\n\t-When riding mounts or controlling vehicles, their movement speed is doubled, and you cannot be forcibly dismounted from them.\n\t-Enemies have disadvantage on attack rolls against you or any friendly creatures within 10 feet of you.\nOnce you use this feature, you can't use it again until you finish a long rest."}
,
  {"name" : "Tenets of Glory", "lvl" : [3], "subclass" : " Glory", "desc" : "\tActions over Words: Strive to be known by glorious deeds, not words.\n\tChallenges Are but Tests: Face hardships with courage, and encourage your allies to face them with you.\n\tHone the Body: Like raw stone, your body must be worked so its potential can be realized.\n\tDiscipline the Soul: You must marshal the discipline to overcome failings within yourself that threaten to dim the glory of you and your friends."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Guiding Bolt~#", "~sn^Heroism~#"] ],
      ["5th", ["~sn^Enhance Ability~#", "~sn^Magic Weapon~#"] ],
      ["9th", ["~sn^Haste~#", "~sn^Protection from Energy~#"] ],
      ["13th", ["~sn^Compulsion~#", "~sn^Freedom of Movement~#"]],
      ["17th", ["~sn^Commune~#", "~sn^Flame Strike~#"]]
    ]}, "lvl" : [3], "subclass" : " Glory", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " Glory", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tPeerless Athlete: As a bonus action, you can use your Channel Divinity to augment your athleticism. For the next 10 minutes, you have advantage on Strength (Athletics) and Dexterity (Acrobatics) checks; you can carry, push, drag, and lift twice as much weight as normal; and the distance of your long and high jumps increases by 10 feet (this extra distance costs movement as normal).\n\tInspiring Smite: Immediately after you deal damage to a creature with your Divine Smite feature, you can use your Channel Divinity as a bonus action and distribute temporary hit points to creatures of your choice within 30 feet of you, which can include you. The total number of temporary hit points equals 2d8 + your level in this class, divided among the chosen creatures however you like."},
  {"name" : "Aura of Alacrity", "lvl" : [7, 18], "prog" : ["(5 feet)", "(10 feet)"], "subclass" : " Glory", "desc" : "At 7th level, you emanate an aura that fills you and your companions with supernatural speed, allowing you to race across a battlefield in formation. Your walking speed increases by 10 feet. In addition, if you aren't incapacitated, the walking speed of any ally who starts their turn within 5 feet of you increases by 10 feet until the end of that turn.\nWhen you reach 18th level in this class, the range of the aura increases to 10 feet."},
  {"name" : "Glorious Defense", "lvl" : [15], "subclass" : " Glory", "desc" : "When you reach 15th level, you can turn defense into a sudden strike. When you or another creature you can see within 10 feet of you is hit by an attack roll, you can use your reaction to grant a bonus to the target's AC against that attack, potentially causing it to miss. The bonus equals your Charisma modifier (minimum of +1). If the attack misses, you can make one weapon attack against the attacker as part of this reaction, provided the attacker is within your weapon's range.\nYou can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a long rest."},
  {"name" : "Living Legend", "lvl" : [20], "subclass" : " Glory", "desc" : "At 20th level, you can empower yourself with the legends — whether true or exaggerated — of your great deeds. As a bonus action, you gain the following benefits for 1 minute:\n\t-You are blessed with an otherworldly presence, gaining advantage on all Charisma checks.\n\t-Once on each of your turns when you make a weapon attack and miss, you can cause that attack to hit instead.\n\t-If you fail a saving throw, you can use your reaction to reroll it. You must use this new roll.\nOnce you use this feature, you can’t use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."}

  ,
  {"name" : "Tenets of the Hashem", "lvl" : [3], "subclass" : " Hashem", "desc" : "\tFaith: You shall carry the rites of Alsham.\n\tLaw: You shall exercise The Law of Alsham as long as it aligns with the law of the land. Alsham shall reward you.\n\tUnderstanding: Wherever possible, criminals should be taught about law, and given a chance to redeem themselves.\n\tPersistence: No criminal shall be left unpursued.\n\tPoverty: One shall hold no riches, and spend its wealth the same way as one does effort, in the upholding of The Law of Alsham."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Iron Awake~#", "~sn^Reveal Curse~#"] ],
      ["5th", ["~sn^Flaming Sphere~#", "~sn^Imperate~#"] ],
      ["9th", ["~sn^Daylight~#", "~sn^Fireball~#"] ],
      ["13th", ["~sn^Death Ward~#", "~sn^Wall of Fire~#"]],
      ["17th", ["~sn^Mass Cure Wounds~#", "~sn^Flame Strike~#"]]
    ]}, "lvl" : [3], "subclass" : " Hashem", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " Hashem", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tEndurance: As a reaction when you take damage, you can choose to endure despite the wounds, reducing the damage taken by a roll of your paladin hit die + your Charisma Modifier (minimum of +1).\n\tJudgement: Immediately after you or an ally you can see within 30 feet lands an attack on a proven criminal, you can spend your Channel Divinity to embolden it. The target must pass a Charisma Saving Throw or take fire damage equal to five times your Paladin Level."},
  {"name" : "Bastion of Law", "lvl" : [7], "subclass" : " Hashem", "desc" : "Starting at 7th level, you have become a bastion for the Law of Alsham. Creatures have disadvantage on Deception checks against you, and you can add your Charisma Modifier (minimum of +1) to Insight, Investigation, and Perception checks."},
  {"name" : "Paragon of Order", "lvl" : [15], "subclass" : " Hashem", "desc" : "When you reach 15th level in this class your very steps spread the Law of Alsham. Creatures within 30 feet of you must pass a Charisma Saving Throw at the start of their turn. On a failure, the creatures become unable to do any action punished in The Law of Alsham.\nCreatures marked to be destroyed in The Law of Alsham take damage equal to your Paladin Level instead."},
  {"name" : "Anointed by The Lawgiver", "lvl" : [20], "subclass" : " Hashem", "desc" : "At 20th level, you become anointed by Alsham to carry his law wherever you tread. You gain the following benefits:\n\t-As an Action, you can do an Insight Check on a creature against its Deception check. On a success, you can sense any crimes the creature has committed, its real identity if it is hidden, and its real name.\n\t-You are immune to gaining Exhaustion levels for performing forced marches or lack of rest. You still need to eat and drink.\n\t-You regain one spent hit die for every hour that passes."}

  ,
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Hellish Rebuke~#", "~sn^Inflict Wounds~#"] ],
      ["5th", ["~sn^Crown of Madness~#", "~sn^Darkness~#"] ],
      ["9th", ["~sn^Animate Dead~#", "~sn^Bestow Curse~#"] ],
      ["13th", ["~sn^Blight~#", "~sn^Confusion~#"]],
      ["17th", ["~sn^Contagion~#", "~sn^Dominate Person~#"]]
    ]}, "lvl" : [3], "subclass" : "Oathbreaker", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : "Oathbreaker", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tControl Undead: As an action, you target one undead creature you can see within 30 feet of you. The target must make a Wisdom saving throw. On a failed save, the target must obey your commands for the next 24 hours, or until you use this Channel Divinity option again. An undead whose challenge rating is equal to or greater than your paladin level is immune to this effect.\n\tDreadful Aspect: As an action, you channel the darkest emotions and focus them into a burst of magical menace. Each creature of your choice within 30 feet of you must make a Wisdom saving throw if it can see you. On a failed save, the target is frightened of you for 1 minute. If a creature frightened by this effect ends its turn more than 30 feet away from you, it can attempt another Wisdom saving throw to end the effect on it."},
  {"name" : "Aura of Hate", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : "Oathbreaker", "desc" : "Starting at 7th level you, as well any fiends and undead within 10 feet of you, gain a bonus to melee weapon damage rolls equal to your Charisma modifier (minimum of +1). A creature can benefit from this feature from only one paladin at a time.\nAt 18th level, the range of this aura increases to 30 feet."},
  {"name" : "Supernatural Resistance", "lvl" : [15], "subclass" : "Oathbreaker", "desc" : "At 15th level, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons."},
  {"name" : "Dread Lord", "lvl" : [20], "subclass" : "Oathbreaker", "desc" : "At 20th level, you can, as an action, surround yourself with an aura of gloom that lasts for 1 minute. The aura reduces any bright light in a 30-foot radius around you to dim light. Whenever an enemy that is frightened by you starts its turn in the aura, it takes 4d10 psychic damage. Additionally, you and any creatures of your choosing in the aura are draped in deeper shadow. Creatures that rely on sight have disadvantage on attack rolls against creatures draped in this shadow.\nWhile the aura lasts, you can use a bonus action on your turn to cause the shadows in the aura to attack one creature. Make a melee spell attack against the target. If the attack hits, the target takes necrotic damage equal to 3d10 + your Charisma modifier.\nAfter activating the aura, you can't do so again until you finish a long rest."}


    ,
  {"name" : "Tenets of Pestilence", "lvl" : [3], "subclass" : " Pestilence", "desc" : "\tStrength in Resilience: Surviving hardship and plague make you stronger. Spreading these things causes strength to flourish.\n\tAll Things Must Pass: Death is the natural conclusion of life. There is nothing unnatural or immoral about the ending of life.\n\tMight Makes Right: The laws of mortals mean nothing to poxes and plagues, they go where they wish and take what they want. So should you."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Bane~#", "~sn^Inflict Wounds~#"] ],
      ["5th", ["~sn^Acid Arrow~#", "~sn^Ray of Enfeeblement~#"] ],
      ["9th", ["~sn^Spirit Guardians~# (Necrotic Only)", "~sn^Stinking Cloud~#"] ],
      ["13th", ["~sn^Blight~#", "~sn^Confusion~#"]],
      ["17th", ["~sn^Contagion~#", "~sn^Insect Plague~#"]]
    ]}, "lvl" : [3], "subclass" : " Pestilence", "desc" : "You gain oath spells at the paladin levels listed in the  Pestilence Spells table."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " Pestilence", "desc" : "When you take this oath at 3rd level, you gain the following Channel Divinity options:\n\tDebilitating Fever: Your touch inflicts disease. As an **Action**, force a creature to make a Constitution Save against your Spell Save DC or become inflicted with a Disease of your choice. Since this ability induces a natural disease in its target, any effect that removes a disease or otherwise ameliorates a disease’s effects apply to it. The disease is contagious unless stated otherwise.\n\tEntropic Infection: You can use your Channel Divinity to weaken a creature against entropic energies. As an **action**, you can force a creature of your choice that you can see within 30 feet of you to make a Constitution saving throw. On a failed save, for the next minute the creature takes an additional 2d6 damage the first time it takes necrotic damage each turn. During this time, the creature loses resistance to necrotic damage if it has it."},
  {"name" : "Necrotic Smites", "lvl" : [3], "subclass" : " Pestilence", "desc" : "Starting at 3rd level when you select this Oath, your Divine Smites are corrupted with Necrotic energy, making them deal **Necrotic Damage** instead of Radiant. This includes the Improved Divine Smite."},
  {"name" : "Aura of Rampant Sickness", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : " Pestilence", "desc" : "Starting at 7th level, you emit an aura of contagion and virulence to a range of 10 feet. When an enemy starts its turn inside of the aura, they are **Poisoned** until the start of their next turn. At 18th level, the range of this aura increases to 30 feet."},
  {"name" : "Disgusting Resilience", "lvl" : [15], "subclass" : " Pestilence", "desc" : "At 15th level, when you take damage which would reduce you to 0 hit points, you can choose to expend any number of Hit Dice. Gain Hit Points equal to the value of the Hit Dice spent as normal."},
  {"name" : "Plaguebringer", "lvl" : [20], "subclass" : " Pestilence", "desc" : "At 20th level, you become an avatar of plague, which gives you the following benefits:\n\t-You have **resistance** to necrotic damage and are **immune** to poison damage and the **poisoned** condition.\n\t-Your hit point maximum can’t be reduced.\nCreatures of your choice who start their turn within 30 feet of you, or who move within 30 feet of you on their turn, take necrotic damage equal to your Charisma modifier. Once a creature takes damage from this ability, it can’t take damage from it again until the start of its next turn."}

,

  {"name" : "Tenets of Redemption", "lvl" : [3], "subclass" : " Redemption", "desc" : "\tPeace: Violence is a weapon of last resort. Diplomacy and understanding are the paths to long-lasting peace.\n\tInnocence: All people begin life in an innocent state, and it is their environment or the influence of dark forces that drives them to evil. By setting the proper example, and working to heal the wounds of a deeply flawed world, you can set anyone on a righteous path.\n\tPatience: Change takes time. Those who have walked the path of the wicked must be given reminders to keep them honest and true. Once you have planted the seed of righteousness in a creature, you must work day after day to allow it to survive and then flourish.\n\tWisdom: Your heart and mind must stay clear, for eventually you will be forced to admit defeat. While every creature can be redeemed, some are so far along the path of evil that you have no choice but to end their lives for the greater good. Any such action must be carefully weighed and the consequences fully understood, but once you have made the decision, follow through with it knowing your path is just."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Sanctuary~#", "~sn^Sleep~#"] ],
      ["5th", ["~sn^Calm Emotions~#", "~sn^Hold Person~#"] ],
      ["9th", ["~sn^Counterspell~#", "~sn^Hypnotic Pattern~#"] ],
      ["13th", ["~sn^Otiluke's Resilient Sphere~#", "~sn^Stoneskin~#"]],
      ["17th", ["~sn^Hold Monster~#", "~sn^Wall of Force~#"]]
    ]}, "lvl" : [3], "subclass" : " Redemption", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : " Redemption", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tEmissary of Peace: You can use your Channel Divinity to augment your presence with divine power. As a bonus action, you grant yourself a +5 bonus to Charisma (Persuasion) checks for the next 10 minutes.\n\tRebuke the Violent: You can use your Channel Divinity to rebuke those who use violence. Immediately after an attacker within 30 feet of you deals damage with an attack against a creature other than you, you can use your reaction to force the attacker to make a Wisdom saving throw. On a failed save, the attacker takes radiant damage equal to the damage it just dealt. On a successful save, it takes half as much damage."},
  {"name" : "Aura of the Guardian", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : " Redemption", "desc" : "Starting at 7th level, you can shield your allies from harm at the cost of your own health. When a creature within 10 feet of you takes damage, you can use your reaction to magically take that damage, instead of that creature taking it. This feature doesn't transfer any other effects that might accompany the damage, and this damage can't be reduced in any way.\nAt 18th level, the range of this aura increases to 30 feet."},
  {"name" : "Protective Spirit", "lvl" : [15], "subclass" : " Redemption", "desc" : "Starting at 15th level, a holy presence mends your wounds in combat. You regain hit points equal to 1d6 + half your paladin level if you end your turn in combat with fewer than half of your hit points remaining and you aren’t incapacitated."},
  {"name" : "Emissary of Redemption", "lvl" : [20], "subclass" : " Redemption", "desc" : "At 20th level, you become an avatar of peace, which gives you two benefits:\n\t-You have resistance to all damage dealt by other creatures (their attacks, spells, and other effects).\n\t-Whenever a creature hits you with an attack, it takes radiant damage equal to half the damage you take from the attack.\nIf you attack a creature, cast a spell on it, or deal damage to it by any means but this feature, neither benefit works against that creature until you finish a long rest."}



  ,{"name" : "Tenets of The Steel Cross", "lvl" : [3], "subclass" : "Oath of The Steel Cross", "desc" : "\tSteel Within: Have no shred of doubt when facing the enemy.\n\tShield Against Darkness: Protect those in need of protection, leave no innocence to the claws of evil.\n\tNo Mercy for The Wicked: Those who willingly stray from Amaunator’s light, and those who seek to undermine it, must be destroyed.\n\tSword of Justice: Carry the Law of Amaunator wherever you thread, be the executioner of its sentences."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Armor of Contempt~#", "~sn^Iron Awake~#"] ],
      ["5th", ["~sn^Litany of War~#", "~sn^Imperate~#"] ],
      ["9th", ["~sn^Sun Shield~#", "~sn^Beacon of Hope~#"] ],
      ["13th", ["~sn^Locate Creature~#", "~sn^Banishment~#"]],
      ["17th", ["~sn^Banishing Smite~#", "~sn^Commune~#"]]
    ]}, "lvl" : [3], "subclass" : "Oath of The Steel Cross", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : "Oath of The Steel Cross", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tGuided Strike: You can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.\n\tVow of Steel: As an action, you begin chanting the Litany of Steel. For the next minute, all hostile creatures have disadvantage on attack rolls on allied creatures within 15 feet of you. This Vow does not affect other creatures utilizing the same Channel Divinity."},
  {"name" : "Aura of Steel", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : "Oath of The Steel Cross", "desc" : "Starting at 7th level, you constantly emanate a crimson aura while you're not incapacitated. The aura extends 10 feet from you in every direction, but not through total cover.\nAny friendly creature within this aura gains damage reduction equal to your Charisma modifier (minimum of +1) against Bludgeoning, Slashing and Piercing damage.\nAt 18th level, the range of this aura increases to 30 feet."},
  {"name" : "Steel Within", "lvl" : [15], "subclass" : "Oath of The Steel Cross", "desc" : "When you reach 15th level in this class, you have become tempered to the evils of the world, and become incorruptible. You are immune to the Charmed condition, and you have advantage on Charisma, Intelligence and Wisdom Saving Throws."},
  {"name" : "Angel of Steel", "lvl" : [20], "subclass" : "Oath of The Steel Cross", "desc" : "At 20th level, you can assume the form of an angel made of steel. As an action, you gain the following benefits for 1 hour:\n\t-Your AC cannot be lower than 20.\n\t-You gain damage reduction to Bludgeoning, Piercing and Slashing damage equal to your Proficiency Bonus.\n\t-You gain a bonus to melee attack and damage rolls using Strength equal to your Charisma Modifier (minimum of +1).\nOnce you use this feature, you can't use it again until you finish a long rest."}


,
  {"name" : "Tenets of Vengeance", "lvl" : [3], "subclass" : "Oath of Vengeance", "desc" : "\tFight the Greater Evil: Faced with a choice of fighting my sworn foes or combating a lesser evil, I choose the greater evil.\n\tNo Mercy for the Wicked: Ordinary foes might win my mercy, but my sworn enemies do not.\n\tBy Any Means Necessary: My qualms can't get in the way of exterminating my foes.\n\tRestitution: If my foes wreak ruin on the world, it is because I failed to stop them. I must help those harmed by their misdeeds."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Bane~#", "~sn^Hunter's Mark~#"] ],
      ["5th", ["~sn^Hold Person~#", "~sn^Misty Step~#"] ],
      ["9th", ["~sn^Haste~#", "~sn^Protection from Energy~#"] ],
      ["13th", ["~sn^Banishment~#", "~sn^Dimension Door~#"]],
      ["17th", ["~sn^Hold Monster~#", "~sn^Scrying~#"]]
    ]}, "lvl" : [3], "subclass" : "Oath of Vengeance", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : "Oath of Vengeance", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tAbjure Enemy: As an action, you present your holy symbol and speak a prayer of denunciation, using your Channel Divinity. Choose one creature within 60 feet of you that you can see. That creature must make a Wisdom saving throw, unless it is immune to being frightened. Fiends and undead have disadvantage on this saving throw.\nOn a failed save, the creature is frightened for 1 minute or until it takes any damage. While frightened, the creature's speed is 0, and it can't benefit from any bonus to its speed.\nOn a successful save, the creature's speed is halved for 1 minute or until the creature takes any damage.\n\tVow of Enmity: As a bonus action, you can utter a vow of enmity against a creature you can see within 10 feet of you, using your Channel Divinity. You gain advantage on attack rolls against the creature for 1 minute or until it drops to 0 hit points or falls unconscious."},
  {"name" : "Relentless Avenger", "lvl" : [7], "subclass" : "Oath of Vengeance", "desc" : "By 7th level, your supernatural focus helps you close off a foe's retreat. When you hit a creature with an opportunity attack, you can move up to half your speed immediately after the attack and as part of the same reaction. This movement doesn't provoke opportunity attacks."},
  {"name" : "Soul of Vengeance", "lvl" : [15], "subclass" : "Oath of Vengeance", "desc" : "Starting at 15th level, the authority with which you speak your Vow of Enmity gives you greater power over your foe. When a creature under the effect of your Vow of Enmity makes an attack, you can use your reaction to make a melee weapon attack against that creature if it is within range."},
  {"name" : "Avenging Angel", "lvl" : [20], "subclass" : "Oath of Vengeance", "desc" : "At 20th level, you can assume the form of an angelic avenger. Using your action, you undergo a transformation. For 1 hour, you gain the following benefits:\n\t-Wings sprout from your back and grant you a flying speed of 60 feet.\n\t-You emanate an aura of menace in a 30-foot radius. The first time any enemy creature enters the aura or starts its turn there during a battle, the creature must succeed on a Wisdom saving throw or become frightened of you for 1 minute or until it takes any damage. Attack rolls against the frightened creature have advantage.\nOnce you use this feature, you can't use it again until you finish a long rest."}

,
  {"name" : "Tenets of the Watchers", "lvl" : [3], "subclass" : "Oath of the Watchers", "desc" : "\tVigilance: The threats you face are cunning, powerful, and subversive. Be ever alert for their corruption.\n\tLoyalty: Never accept gifts or favors from fiends or those who truck with them. Stay true to your order, your comrades, and your duty.\n\tDiscipline: You are the shield against the endless terrors that lie beyond the stars. Your blade must be forever sharp and your mind keen to survive what lies beyond."},
  {"name" : "Oath Spells", "table" : {"column_names" : ["Paladin Level", "Spells"], "columns" : [
      ["3rd", ["~sn^Alarm~#", "~sn^Detect Magic~#"] ],
      ["5th", ["~sn^Moonbeam~#", "~sn^See Invisibility~#"] ],
      ["9th", ["~sn^Counterspell~#", "~sn^Nondetection~#"] ],
      ["13th", ["~sn^Aura of Purity~#", "~sn^Banishment~#"]],
      ["17th", ["~sn^Hold Monster~#", "~sn^Scrying~#"]]
    ]}, "lvl" : [3], "subclass" : "Oath of the Watchers", "desc" : "You gain oath spells at the paladin levels listed."},
  {"name" : "Channel Divinity", "lvl" : [3], "subclass" : "Oath of the Watchers", "desc" : "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\tWatcher's Will: You can use your Channel Divinity to invest your presence with the warding power of your faith. As an action, you can choose a number of creatures you can see within 30 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). For 1 minute, you and the chosen creatures have advantage on Intelligence, Wisdom, and Charisma saving throws.\n\tAbjure the Extraplanar: You can use your Channel Divinity to castigate unworldly beings. As an action, you present your holy symbol and each aberration, celestial, elemental, fey, or fiend within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is **turned** for 1 minute or until it takes damage.\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly end its move in a space within 30 feet of you. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can take the Dodge action."},
  {"name" : "Aura of the Sentinel", "lvl" : [7, 18], "prog" : ["(10 feet)", "(30 feet)"], "subclass" : "Oath of the Watchers", "desc" : "At 7th level, you emit an aura of alertness while you aren't incapacitated. When you and any creatures of your choice within 10 feet of you roll initiative, you all gain a bonus to initiative equal to your proficiency bonus.\nAt 18th level, the range of this aura increases to 30 feet."},
  {"name" : "Vigilant Rebuke", "lvl" : [15], "subclass" : "Oath of the Watchers", "desc" : "At 15th level, you've learned how to chastise anyone who dares wield beguilements against you and your wards. Whenever you or a creature you can see within 30 feet of you succeeds on an Intelligence, a Wisdom, or a Charisma saving throw, you can use your reaction to deal 2d8 + your Charisma modifier force damage to the creature that forced the saving throw."},
  {"name" : "Mortal Bulwark", "lvl" : [20], "subclass" : "Oath of the Watchers", "desc" : "At 20th level, you manifest a spark of divine power in defense of the mortal realms. As a bonus action, you gain the following benefits for 1 minute:\n\t-You gain **truesight** with a range of 120 feet.\n\t-You have advantage on attack rolls against aberrations, celestials, elementals, fey, and fiends.\n\t-When you hit a creature with an attack roll and deal damage to it, you can also force it to make a Charisma saving throw against your spell save DC. On a failed save, the creature is magically **banished** to its native plane of existence if it's currently not there. On a successful save, the creature can't be banished by this feature for 24 hours.\nOnce you use this bonus action, you can't use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."}


    ]
}