{

    "name" : "Bard",
    "caster_type" : "Full",
    "hitDie" : 8,
    "armor_prof" : ["Light"],
    "weapon_prof" : ["Simple", "Hand Crossbows", "Longswords", "Rapiers", "Shortswords"],
    "tools_prof" : [{"choice" : 3, "type" : "Instruments"}],
    "saving_throws" : ["Dexterity", "Charisma"],
    "skill_prof" : {"choice" : 3, "skills" : ["any"]},
    "equipment" : ["(a) a rapier, (b) a longsword, or (c) any simple weapon", "(a) a diplomat's pack or (b) an entertainer's pack", "(a) a lute or (b) any other musical instrument", "Leather armor and a dagger"],
    "starting_gold" : {"multiplier" : 10, "num_die" : 5, "die" : 4},
    "misc_table_features" : 
    {"Cantrips Known"
    : [2, 2, 2, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4],
    "Spells Known" 
    : [4, 5, 6, 7, 8, 9, 10, 11, 12, 14, 15, 15, 16, 18, 19, 19, 20, 22, 22, 22]
    },
    "features" : [
        
        {"name" : "Spellcasting", "lvl" : [1], "desc" : "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations."},
        {"name" : "Cantrips", "lvl" : [1], "sub" : true, "desc" : "You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Bard table."},
        {"name" : "Spell Slots", "lvl" : [1], "sub" : true,"desc" : "The Bard table shows how many spell slots you have to cast your bard spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. For example, if you know the 1st-level spell Cure Wounds and have a 1st-level and a 2nd-level spell slot available, you can cast Cure Wounds using either slot."},
        {"name" : "Spells Known of 1st Level and Higher", "sub" : true, "lvl" : [1], "desc" : "You know four 1st-level spells of your choice from the bard spell list.The Spells Known column of the Bard table shows when you learn more bard spells of your choice. Each of these spells must be of a level for which you have spell slots, as shown on the table. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.Additionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots."},
        {"name" : "Spellcasting Ability", "lvl" : [1], "sub" : true, "desc" : "Charisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one. Spell save DC = 8 + your proficiency bonus + your Charisma modifier. Spell attack modifier = your proficiency bonus + your Charisma modifier"},
        {"name" : "Ritual Casting", "lvl" : [1], "sub" : true,"desc" : "At 2nd level, you've gained the ability to imbue mundane items with certain magical infusions, turning those objects into magic items."},
        {"name" : "Spellcasting Focus", "lvl" : [1], "sub" : true,"desc" : "You can use a musical instrument (found in chapter 5) as a spellcasting focus for your bard spells."},
        {"name" : "Bardic Inspiration", "prog" : ["d6", "d8", "d10", "d12"], "lvl" : [1, 5, 10, 15], "desc" : "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.\nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.\nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."},
        {"name" : "Jack of All Trades", "lvl" : [2], "desc" : "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus."},
        {"name" : "Song of Rest", "prog" : ["d6", "d8", "d10", "d12"], "lvl" : [2, 9, 13, 17], "desc" : "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra Hit Points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."},
        {"name" : "Magical Inspiration (Optional)", "lvl" : [2], "desc" : "At 2nd level, if a creature has a Bardic Inspiration die from you and casts a spell that restores hit points or deals damage, the creature can roll that die and choose a target affected by the spell. Add the number rolled as a bonus to the hit points regained or the damage dealt. The Bardic Inspiration die is then lost."},
        {"name" : "Bard College", "lvl" : [3],  "subclassOptions" : true, "desc" : "At 3rd level, you delve into the advanced techniques of a bard college of your choice. Your choice grants you features at 3rd level and again at 6th and 14th level." },
        {"name" : "Expertise", "lvl" : [3, 10], "desc" : "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 10th level, you can choose another two skill proficiencies to gain this benefit."},
        {"name" : "Ability Score Improvement", "lvl" : [4, 8, 12, 16, 19], "desc" : "When you reach 4th level, 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."},
        {"name" : "Bardic Versatility (Optional)", "lvl" : [4, 8, 12, 16, 19], "desc" : "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can do one of the following, representing a change in focus as you use your skills and magic:Replace one of the skills you chose for the Expertise feature with one of your other skill proficiencies that isn't benefiting from Expertise.Replace one cantrip you learned from this class's Spellcasting feature with another cantrip from the bard spell list."},
        {"name" : "Font of Inspiration", "lvl" : [5], "desc" : "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."},
        {"name" : "Countercharm", "lvl" : [6], "desc" : "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."},
        {"name" : "Magical Secrets", "lvl" : [10, 14, 18], "desc" : "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any classes at 14th level and again at 18th level."},
        {"name" : "Superior Inspiration", "lvl" : [20], "desc" : "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."},
      
        {"name" : "Mote of Potential", "subclass" : "Creation", "lvl" : [3], "desc" : "When you join the College of Creation at 3rd level, whenever you give a creature a Bardic Inspiration die, you can utter a note from the Song of Creation to create a Tiny mote of potential, which orbits within 5 feet of that creature. The mote is intangible and invulnerable, and it lasts until the Bardic Inspiration die is lost. The mote looks like a musical note, a star, a flower, or another symbol of art or life that you choose.When the creature uses the Bardic Inspiration die, the mote provides an additional effect based on whether the die benefits an ability check, an attack roll, or a saving throw, as detailed below:Ability Check. When the creature rolls the Bardic Inspiration die to add it to an ability check, the creature can roll the Bardic Inspiration die again and choose which roll to use, as the mote pops and emits colorful, harmless sparks for a moment. Attack Roll. Immediately after the creature rolls the Bardic Inspiration die to add it to an attack roll against a target, the mote thunderously shatters. The target and each creature of your choice that you can see within 5 feet of it must succeed on a Constitution saving throw against your spell save DC or take thunder damage equal to the number rolled on the Bardic Inspiration die. Saving Throw. Immediately after the creature rolls the Bardic Inspiration die and adds it to a saving throw, the mote vanishes with the sound of soft music, causing the creature to gain temporary hit points equal to the number rolled on the Bardic Inspiration die plus your Charisma modifier (minimum of 1 temporary hit point)."},
        {"name" : "Performance of Creation", "subclass" : "Creation", "lvl" : [3], "desc" : "Also at 3rd level, as an action, you can channel the magic of the Song of Creation to create one nonmagical item of your choice in an unoccupied space within 10 feet of you. The item must appear on a surface or in a liquid that can support it. The gp value of the item can't be more than 20 times your bard level, and the item must be Medium or smaller. The item glimmers softly, and a creature can faintly hear music when touching it. The created item disappears after a number of hours equal to your proficiency bonus. For examples of items you can create, see the equipment chapter of the Player's Handbook.\nOnce you create an item with this feature, you can't do so again until you finish a long rest, unless you expend a spell slot of 2nd level or higher to use this feature again. You can have only one item created by this feature at a time; if you use this action and already have an item from this feature, the first one immediately vanishes.\nThe size of the item you can create with this feature increases by one size category when you reach 6th level (Large) and 14th level (Huge)."},
        {"name" : "Animating Performance", "subclass" : "Creation", "lvl" : [6], "desc" : "By 6th level, as an action, you can animate one Large or smaller nonmagical item within 30 feet of you that isn’t being worn or carried. The animate item uses the Dancing Item stat block, which uses your proficiency bonus (PB), [INSERT STAT BLOCK HERE] The item is friendly to you and your companions and obeys your commands. It lives for 1 hour, until it is reduced to 0 hit points, or until you die.\nIn combat, the item shares your initiative count, but it takes its turn immediately after yours. It can move and use its reaction on its own, but the only action it takes on its turn is the Dodge action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. If you are incapacitated, the item can take any action of its choice, not just Dodge.\nWhen you use your Bardic Inspiration feature, you can command the item as part of the same bonus action you use for Bardic Inspiration.\nOnce you animate an item with this feature, you can't do so again until you finish a long rest, unless you expend a spell slot of 3rd level or higher to use this feature again. You can have only one item animated by this feature at a time; if you use this action and already have a dancing item from this feature, the first one immediately becomes inanimate."},
        {"name" : "Creative Crescendo",  "subclass" : "Creation", "lvl" : [14], "desc" : "At 14th level, when you use your Performance of Creation feature, you can create more than one item at once. The number of items equals your Charisma modifier (minimum of two items). If you create an item that would exceed that number, you choose which of the previously created items disappears. Only one of these items can be of the maximum size you can create; the rest must be Small or Tiny.\nYou are no longer limited by gp value when creating items with Performance of Creation."},

        
        {"name" : "Silver Tongue", "subclass" : "Eloquence", "lvl" : [3], "desc" : "Starting at 3rd level, you are a master at saying the right thing at the right time. When you make a Charisma (Persuasion) or Charisma (Deception) check, you can treat a d20 roll of 9 or lower as a 10."},
        {"name" : "Unsettling Words", "subclass" : "Eloquence", "lvl" : [3], "desc" : "Also at 3rd level, you can spin words laced with magic that unsettle a creature and cause it to doubt itself. As a bonus action, you can expend one use of your Bardic Inspiration and choose one creature you can see within 60 feet of you. Roll the Bardic Inspiration die. The creature must subtract the number rolled from the next saving throw it makes before the start of your next turn."},
        {"name" : "Unfailing Inspiration", "subclass" : "Eloquence", "lvl" : [6], "desc" : "At 6th level, your inspiring words are so persuasive that others feel driven to succeed. When a creature adds one of your Bardic Inspiration dice to its ability check, attack roll, or saving throw and the roll fails, the creature can keep the Bardic Inspiration die."},
        {"name" : "Universal Speech", "subclass" : "Eloquence", "lvl" : [6], "desc" : "Also at 6th level, you have gained the ability to make your speech intelligible to any creature. As an action, choose one or more creatures within 60 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). The chosen creatures can magically understand you, regardless of the language you speak, for 1 hour.Once you use this feature, you can't use it again until you finish a long rest, unless you expend a spell slot to use it again."},
        {"name" : "Infectious Inspiration", "subclass" : "Eloquence", "lvl" : [14], "desc" : "At 14th level, when you successfully inspire someone, the power of your eloquence can now spread to someone else. When a creature within 60 feet of you adds one of your Bardic Inspiration dice to its ability check, attack roll, or saving throw and the roll succeeds, you can use your reaction to encourage a different creature (other than yourself) that can hear you within 60 feet of you, giving it a Bardic Inspiration die without expending any of your Bardic Inspiration uses.You can use this reaction a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a long rest."},


        {"name" : "Mantle of Inspiration", "subclass" : "Glamour", "lvl" : [3], "desc" : "When you join the College of Glamour at 3rd level, you gain the ability to weave a song of fey magic that imbues your allies with vigor and speed.As a bonus action, you can expend one use of your Bardic Inspiration to grant yourself a wondrous appearance. When you do so, choose a number of creatures you can see and who can see you within 60 feet of you, up to a number equal to your Charisma modifier (minimum of one). Each of them gains 5 temporary hit points. When a creature gains these temporary hit points, it can immediately use its reaction to move up to its speed, without provoking opportunity attacks.The number of temporary hit points increases when you reach certain levels in this class, increasing to 8 at 5th level, 11 at 10th level, and 14 at 15th level."},
        {"name" : "Enthralling Performance", "subclass" : "Glamour", "lvl" : [3], "desc" : "Starting at 3rd level, you can charge your performance with seductive, fey magic. If you perform for at least 1 minute, you can attempt to inspire wonder in your audience by singing, reciting a poem, or dancing. At the end of the performance, choose a number of humanoids within 60 feet of you who watched and listened to all of it, up to a number equal to your Charisma modifier (minimum of one). Each target must succeed on a Wisdom saving throw against your spell save DC or be charmed by you. While charmed in this way, the target idolizes you, it speaks glowingly of you to anyone who speaks to it, and it hinders anyone who opposes you, avoiding violence unless it was already inclined to fight on your behalf. This effect ends on a target after 1 hour, if it takes any damage, if you attack it, or if it witnesses you attacking or damaging any of its allies.If a target succeeds on its saving throw, the target has no hint that you tried to charm it.Once you use this feature, you can’t use it again until you finish a short or long rest."},
        {"name" : "Mantle of Majesty", "subclass" : "Glamour", "lvl" : [6], "desc" : "At 6th level, you gain the ability to cloak yourself in a fey magic that makes others want to serve you. As a bonus action, you cast Command, without expending a spell slot, and you take on an appearance of unearthly beauty for 1 minute or until your concentration ends (as if you were concentrating on a spell). During this time, you can cast Command as a bonus action on each of your turns, without expending a spell slot.Any creature charmed by you automatically fails its saving throw against the Command you cast with this feature.Once you use this feature, you can’t use it again until you finish a long rest."},
        {"name" : "Unbreakable Majesty", "subclass" : "Glamour", "lvl" : [14], "desc" : "At 14th level, your appearance permanently gains an otherworldly aspect that makes you look more lovely and fierce.In addition, as a bonus action, you can assume a magically majestic presence for 1 minute or until you are incapacitated. For the duration, whenever any creature tries to attack you for the first time on a turn, the attacker must make a Charisma saving throw against your spell save DC. On a failed save, it can't attack you on this turn, and it must choose a new target for its attack or the attack is wasted. On a successful save, it can attack you on this turn, but it has disadvantage on any saving throw it makes against your spells on your next turn.Once you assume this majestic presence, you can't do so again until you finish a short or long rest."},

        {"name" : "Lore Bard Proficiencies", "subclass" : "Lore", "lvl" : [3], "desc" : "When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice."},
        {"name" : "Cutting Words", "subclass" : "Lore", "lvl" : [3], "desc" : "Also at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature's roll. You can choose to use this feature after the creature makes its roll, but before the DM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can't hear you or if it's immune to being charmed."},
        {"name" : "Additional Magical Secrets", "subclass" : "Lore", "lvl" : [6], "desc" : "At 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don't count against the number of bard spells you know."},
        {"name" : "Peerless Skill", "subclass" : "Lore", "lvl" : [14], "desc" : "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the DM tells you whether you succeed or fail."},

        {"name" : "Guiding Whispers", "subclass" : "Spirits", "lvl" : [3], "desc" : "At 3rd level, you can reach out to spirits to guide you and others. You learn the Guidance cantrip, which doesn’t count against the number of bard cantrips you know. For you, it has a range of 60 feet when you cast it."},
        {"name" : "Spiritual Focus", "subclass" : "Spirits", "prog" : ["", "additional benefit"], "lvl" : [3, 6], "desc" : "At 3rd level, you employ tools that aid you in channeling spirits, be they historical figures or fictional archetypes. You can use the following objects as a spellcasting focus for your bard spells: a candle, crystal ball, skull, spirit board, or tarokka deck. Starting at 6th level, when you cast a bard spell that deals damage or restores hit points through the Spiritual Focus, roll a d6, and you gain a bonus to one damage or healing roll of the spell equal to the number rolled."},
        {"name" : "Tales from Beyond", "table" : {"column_names" : ["Bardic Die", "Tale Told"], "columns" : 
[
    [
        "1",
        "Tale of the Clever Animal. For the next 10 minutes, whenever the target makes an Intelligence, a Wisdom, or a Charisma check, the target can roll an extra die immediately after rolling the d20 and add the extra die's number to the check. The extra die is the same type as your Bardic Inspiration die."
    ],
    [
        "2",
        "Tale of the Renowned Duelist. You make a melee spell attack against the target. On a hit, the target takes force damage equal to two rolls of your Bardic Inspiration die + your Charisma modifier."
    ],
    [
        "3",
        "Tale of the Beloved Friends. The target and another creature of its choice it can see within 5 feet of it gains temporary hit points equal to a roll of your Bardic Inspiration die + your Charisma modifier"
    ],
    [
        "4",
        "Tale of the Runaway. The target can immediately use its reaction to teleport up to 30 feet to an unoccupied space it can see. When the target teleports, it can choose a number of creatures it can see within 30 feet of it up to your Charisma modifier (minimum of 0) to immediately use the same reaction."
    ],
    [
        "5",
        "Tale of the Avenger. For 1 minute, any creature that hits the target with a melee attack takes force damage equal to a roll of your Bardic Inspiration die."
    ],
    [
        "6",
        "Tale of the Traveler. The target gains temporary hit points equal to a roll of your Bardic Inspiration die + your bard level. While it has these temporary hit points, the target’s walking speed increases by 10 feet and it gains a +1 bonus to its AC."
    ],
    [
        "7",
        "Tale of the Beguiler. The target must succeed on a Wisdom saving throw or take psychic damage equal to two rolls of your Bardic Inspiration die, and the target is incapacitated until the end of its next turn."
    ],
    [
        "8",
        "Tale of the Phantom. The target becomes invisible until the end of its next turn or until it hits a creature with an attack. If it hits a creature with an attack during this invisibility, the creature it hits takes necrotic damage equal to a roll of your Bardic Inspiration die and is frightened of the target until the end of the frightened creature's next turn."
    ],
    [
        "9",
        "Tale of the Brute. Each creature of the target’s choice it can see within 30 feet of it must make a Strength saving throw. On a failed save, a creature takes thunder damage equal to three rolls of your Bardic Inspiration die and is knocked prone. A creature that succeeds on its saving throw takes half as much damage and isn’t knocked prone."
    ],
    [
        "10",
        "Tale of the Dragon. The target spews fire from the mouth in a 30-foot cone. Each creature in that area must make a Dexterity saving throw, taking fire damage equal to four rolls of your Bardic Inspiration die on a failed save, or half as much damage on a successful one."
    ],
    [
        "11",
        "Tale of the Angel. The target regains hit points equal to two rolls of your Bardic Inspiration die + your Charisma modifier, and you end one condition from the following list affecting the target: blinded, deafened, paralyzed, petrified, or poisoned."
    ],
    [
        "12",
        "Tale of the Mind-Bender You envoke an incomprehensible fable from an otherworldly being. The target must succeed on an Intelligence saving throw or take psychic damage equal to three rolls of your Bardic Inspiration die and be stunned until the end of its next turn."
    ]
]

        },
"subclass" : "Spirits", "lvl" : [3], "desc" : "At 3rd level, you reach out to spirits who tell their tales through you. While you are holding your Spiritual Focus, you can use a bonus action to expend one use of your Bardic Inspiration and roll on the Spirit Tales table using your Bardic Inspiration die to determine the tale the spirits direct you to tell. You retain the tale in mind until you bestow the tale’s effect or you finish a short or long rest.You can use an action to choose one creature you can see within 30 feet of you (this can be you) to be the target of the tale’s effect. Once you do so, you can’t bestow the tale’s effect again until you roll it again.You can retain only one of these tales in mind at a time, and rolling on the Spirit Tales table immediately ends the effect of the previous tale.If the tale requires a saving throw, the DC equals your spell save DC."},
        {"name" : "Spirit Session", "subclass" : "Spirits", "lvl" : [6], "desc" : "At 6th level, spirits provide you with supernatural insights. You can conduct an hour-long ritual channeling spirits (which can be done during a short or long rest) using your Spiritual Focus. You can conduct the ritual with a number of willing creatures equal to your proficiency bonus (including yourself). At the end of the ritual, you temporarily learn one spell of your choice from any class.The spell you choose must be of a level equal to the number of creatures that conducted the ritual or less, the spell must be of a level you can cast, and it must be in the school of Divination or Necromancy. The chosen spell counts as a bard spell for you but doesn’t count against the number of bard spells you know.Once you perform the ritual, you can’t do so again until you start a long rest, and you know the chosen spell until you start a long rest."},
        {"name" : "Mystical Connection", "subclass" : "Spirits", "lvl" : [14], "desc" : "At 14th level, you now have the ability to nudge the spirits of Tales from Beyond toward certain tales. Whenever you roll on the Spirit Tales table, you can roll the die twice and choose which of the two effects to bestow. If you roll the same number on both dice, you can ignore the number and choose any effect on the table."},


       {
        "name": "Sword Bard Proficiences",
        "subclass": "Swords",
        "lvl": [
            3
        ],
        "desc": "When you join the College of Swords at 3rd level, you gain proficiency with medium armor, Combat Blades and Dueling Blades.If you’re proficient with a simple or martial melee weapon, you can use it as a spellcasting focus for your bard spells."
    },
    {
        "name": "Fighting Style",
        "subclass": "Swords",
        "lvl": [
            3
        ],
        "desc": "At 3rd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. Dueling. When you are attacking a melee weapon with the finesse property using Dexterity and nothing else in your hands, you may add a +2 to your attack rolls. Two-Weapon Fighting. When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
    },
    {
        "name": "Blade Flourish",
        "subclass": "Swords",
        "lvl": [
            3
        ],
        "desc": "At 3rd level, you learn to conduct impressive displays of martial prowess and speed. Whenever you take the Attack action on your turn, your walking speed increases by 10 feet until the end of the turn, and if a weapon attack that you make as part of this action hits a creature, you can use one of the following Blade Flourish options of your choice. You can use only one Blade Flourish option per turn. Defensive Flourish. You can expend one use of your Bardic Inspiration to cause the weapon to deal extra damage to the target you hit. The damage equals the number you roll on the Bardic Inspiration die. You also add the number rolled to your AC until the start of your next turn. Slashing Flourish. You can expend one use of your Bardic Inspiration to cause the weapon to deal extra damage to the target you hit and to any other creature of your choice that you can see within 5 feet of you. The damage equals the number you roll on the Bardic Inspiration die. Mobile Flourish. You can expend one use of your Bardic Inspiration to cause the weapon to deal extra damage to the target you hit. The damage equals the number you roll on the Bardic Inspiration die. You can also push the target up to 5 feet away from you, plus a number of feet equal to the number you roll on that die. You can then immediately use your reaction to move up to your walking speed to an unoccupied space within 5 feet of the target."
    },
    {
        "name": "Extra Attack",
        "subclass": "Swords",
        "lvl": [
            6
        ],
        "desc": "Starting at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    {
        "name": "Master's Flourish",
        "subclass": "Swords",
        "lvl": [
            14
        ],
        "desc": "Starting at 14th level, whenever you use a Blade Flourish option, you can roll a d6 and use it instead of expending a Bardic Inspiration die."
    },
    {
        "name": "Valor Bard Proficiences",
        "subclass": "Valor",
        "lvl": [
            3
        ],
        "desc": "When you join the College of Valor at 3rd level, you gain proficiency with Medium & Heavy armor armor, shields, and martial weapons."
    },
    {
        "name": "Fighting Style",
        "subclass": "Valor",
        "lvl": [
            3
        ],
        "desc": "At 3rd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. Horn Bearer. When a friendly creature within 5 feet of you attacks another target that you can see, you can use your reaction to grant it advantage on its attack roll. You must be holding an instrument in one of your hands (and nothing else in that hand) to use this reaction. Great Weapon Fighting. When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die"
    },
    {
        "name": "Combat Inspiration",
        "subclass": "Valor",
        "lvl": [
            3
        ],
        "desc": "Also at 3rd level, you learn to inspire others in battle. A creature that has a Bardic Inspiration die from you can roll that die and add the number rolled to a weapon damage roll it just made. Alternatively, when an attack roll is made against the creature, it can use its reaction to roll the Bardic Inspiration die and add the number rolled to its AC against that attack, after seeing the roll but before knowing whether it hits or misses."
    },
    {
        "name": "Extra Attack",
        "subclass": "Valor",
        "lvl": [
            6
        ],
        "desc": "Starting at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    {
        "name": "Battle Magic",
        "subclass": "Valor",
        "lvl": [
            14
        ],
        "desc": "At 14th level, you have mastered the art of weaving spellcasting and weapon use into a single harmonious act. When you use your action to cast a bard spell, you can make one weapon attack as a bonus action."
    },
    {
        "name": "Psychic Blades",
        "subclass": "Whispers",
        "lvl": [
            3
        ],
        "desc": "When you join the College of Whispers at 3rd level, you gain the ability to make your weapon attacks magically toxic to a creature's mind. When you hit a creature with a weapon attack, you can expend one use of your Bardic Inspiration to deal an additional 2d6 psychic damage to that target. You can do so only once per round on your turn. The psychic damage increases when you reach certain levels in this class, increasing to 3d6 at 5th level, 5d6 at 10th level, and 8d6 at 15th level."
    },
    {
        "name": "Words of Terror",
        "subclass": "Whispers",
        "lvl": [
            3
        ],
        "desc": "At 3rd level, you learn to infuse innocent-seeming words with an insidious magic that can inspire terror. If you speak to a humanoid alone for at least 1 minute, you can attempt to seed paranoia and fear into its mind. At the end of the conversation, the target must succeed on a Wisdom saving throw against your spell save DC or be frightened of you or another creature of your choice. The target is frightened in this way for 1 hour, until it is attacked or damaged, or until it witnesses its allies being attacked or damaged. If the target succeeds on its saving throw, the target has no hint that you tried to frighten it. Once you use this feature, you can't use it again until you finish a short rest or long rest."
    },
    {
        "name": "Mantle of Whispers",
        "subclass": "Whispers",
        "lvl": [
            6
        ],
        "desc": "At 6th level, you gain the ability to adopt a humanoid's persona. When a humanoid dies within 30 feet of you, you can magically capture its shadow using your reaction. You retain this shadow until you use it or you finish a long rest. You can use the shadow as an action. When you do so, it vanishes, magically transforming into a disguise that appears on you. You now look like the dead person, but healthy and alive. This disguise lasts for 1 hour or until you end it as a bonus action. While you're in the disguise, you gain access to all information that the humanoid would freely share with a casual acquaintance. Such information includes general details on its background and personal life, but doesn't include secrets. The information is enough that you can pass yourself off as the person by drawing on its memories. Another creature can see through this disguise by succeeding on a Wisdom (Insight) check contested by your Charisma (Deception) check. You gain a +5 bonus to your check. Once you capture a shadow with this feature, you can't capture another one with it until you finish a short or long rest."
    },
    {
        "name": "Shadow Lore",
        "subclass": "Whispers",
        "lvl": [
            14
        ],
        "desc": "At 14th level, you gain the ability to weave dark magic into your words and tap into a creature’s deepest fears. As an action, you magically whisper a phrase that only one creature of your choice within 30 feet of you can hear. The target must make a Wisdom saving throw against your spell save DC. It automatically succeeds if it doesn’t share a language with you or if it can’t hear you. On a successful saving throw, your whisper sounds like unintelligible mumbling and has no effect. If the target fails its saving throw, it is charmed by you for the next 8 hours or until you or your allies attack or damage it. It interprets the whispers as a description of its most mortifying secret. While you gain no knowledge of this secret, the target is convinced you know it. While charmed in this way, the creature obeys your commands for fear that you will reveal its secret. It won’t risk its life for you or fight for you, unless it was already inclined to do so. It grants you favors and gifts it would offer to a close friend. When the effect ends, the creature has no understanding of why it held you in such fear. Once you use this feature, you can’t use it again until you finish a long rest."
    }

    ]
}